Busemann505_fine_Ma1.7/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    back
    {
        type            empty;
        physicalType    patch;
        nFaces          19970;
        startFace       29756;
    }
    front
    {
        type            empty;
        physicalType    patch;
        nFaces          19970;
        startFace       49726;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          64;
        startFace       69696;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          64;
        startFace       69760;
    }
    upperairfoil
    {
        type            patch;
        physicalType    patch;
        nFaces          135;
        startFace       69824;
    }
    lowerairfoil
    {
        type            patch;
        physicalType    patch;
        nFaces          135;
        startFace       69959;
    }
)

// ************************************************************************* //
