Busemann505_fine_Ma1.7/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

#include "include/initialConditions"
internalField   uniform $pressure;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $pressure;
    }

    outlet
    {
        type            zeroGradient;
    }


    upperairfoil
    {
        type            zeroGradient;
    }

    lowerairfoil
    {
        type            zeroGradient;
    }

   front
    {
        type            empty;
    }

   back
    {
        type            empty;
    }
}

// ************************************************************************* //
